Thanks, @mingfang, with version 0.1.6 it works like a charm!

```
Terraform will perform the following actions:                                  
                                                                               
  # k8s_core_v1_secret.app_saml will be created                                
  + resource "k8s_core_v1_secret" "app_saml" {                                 
      + data        = (sensitive value)                                        
      + id          = (known after apply)                                      
      + string_data = (known after apply)                                                                                                                     
      + type        = (known after apply)                                      
                                                                               
      + metadata {                                                             
          + annotations                   = (known after apply)                
          + creation_timestamp            = (known after apply)                
          + deletion_grace_period_seconds = (known after apply)                
          + deletion_timestamp            = (known after apply)                                                                                               
          + labels                        = (known after apply)                
          + name                          = "app-saml"
          + namespace                     = "app"
          + resource_version              = (known after apply)
          + self_link                     = (known after apply)
          + uid                           = (known after apply)
        }
    }
```